Tekla.Structures.Drawing.DrawingEnumeratorBase
The DrawingEnumeratorBase class is a base class for DrawingObjectEnumerator and DrawingEnumerator.
The following example gets all the drawings and the objects of the drawings.
using Tekla.Structures.Drawing;
using System.Windows.Forms;
public class Example
{
TreeView drawingListTreeView = new TreeView();
DrawingHandler DrawingHandler = new DrawingHandler();
CheckBox ShowViews = new CheckBox();
CheckBox ShowObjectsInViews = new CheckBox();
private void AddDrawingInformationToDrawingListTreeView()
{
drawingListTreeView.Nodes.Clear();
DrawingEnumerator DrawingList = DrawingHandler.GetDrawings(); // Get drawing list.
while (DrawingList.MoveNext())
{
Drawing CurrentDrawing = DrawingList.Current;
// Add the drawing name to the UI tree.
TreeNode DrawingNode = new TreeNode();
DrawingNode.Tag = CurrentDrawing;
DrawingNode.Text = "" + CurrentDrawing.GetType();
if (ShowViews.Checked)
AddChildDrawingObjectsToTreeNode(DrawingNode, CurrentDrawing.GetSheet()); // Add all the objects placed to the sheet to the UI tree.
drawingListTreeView.Nodes.Add(DrawingNode);
}
}
private void AddChildDrawingObjectsToTreeNode(TreeNode Node, Tekla.Structures.Drawing.IHasChildren CurrentContainer)
{
DrawingObjectEnumerator ObjectList = CurrentContainer.GetObjects(); // Gets the objects that are placed directly to the current container object.
ObjectList.SelectInstances = false; // The instances don't need to be automatically selected, only whether the object exists or not has to be found out (objects properties are not used at all).
while (ObjectList.MoveNext())
{
if(ShowObjectsInViews.Checked || ObjectList.Current is ViewBase)
{
TreeNode CurrentNode = new TreeNode("" + ObjectList.Current.GetType());
CurrentNode.Tag = ObjectList.Current;
if (ObjectList.Current is Tekla.Structures.Drawing.IHasChildren)
AddChildDrawingObjectsToTreeNode(CurrentNode, ObjectList.Current as IHasChildren);
Node.Nodes.Add(CurrentNode);
}
}
}
}

Tekla.Structures.Drawing.DrawingEnumeratorBase._ObjectIDs
List of IDs of enumerated objects

Tekla.Structures.Drawing.DrawingEnumeratorBase._ObjectTypes
List of types of enumerated objects

Tekla.Structures.Drawing.DrawingEnumeratorBase.CurrentItem
Index of current item

Tekla.Structures.Drawing.DrawingEnumeratorBase.CurrentSelected
Instance of current item

Tekla.Structures.Drawing.DrawingEnumeratorBase.SerializedObjects
List of serialized objects

Tekla.Structures.Drawing.DrawingEnumeratorBase.SerializedDrawings
List of serialized drawings

Tekla.Structures.Drawing.DrawingEnumeratorBase.SelectInstances
Indicates that the instance Select() is called when the 'Current' item is asked from the enumerator.
The user can set this to 'false' if no members are ever asked from the instance. This is the case
when, for example, asking only a report property from the identifier. Warning: normally the user should not
change this value.

Tekla.Structures.Drawing.DrawingEnumeratorBase.AutoFetch
Indicates that the objects are fetched from the drawing when the enumerator is created.
Object information is therefore not anymore fetched when 'Current' item is asked from the enumerator.
Property value is used for all enumerators in application

Tekla.Structures.Drawing.DrawingEnumeratorBase.#ctor(Tekla.Structures.Drawing.DrawingEnumeratorBase.EnumeratorTypeEnum,Tekla.Structures.Drawing.DrawingEnumeratorBase.EnumeratorSubTypeEnum,Tekla.Structures.Identifier,Tekla.Structures.Identifier,System.Type[])
Instantiates a new enumerator of given type.
Type: Type of enumerator
SubType: Subtype of enumerator
FatherIdentifier: Id of father object
DrawingIdentifier: Drawing from which data is fetched
types: Type filter.

Tekla.Structures.Drawing.DrawingEnumeratorBase.#ctor(Tekla.Structures.Drawing.DrawingEnumeratorBase.EnumeratorTypeEnum,Tekla.Structures.Drawing.DrawingEnumeratorBase.EnumeratorSubTypeEnum,Tekla.Structures.Identifier,Tekla.Structures.Identifier,Tekla.Structures.Identifier,System.Type[])
Instantiates a new enumerator of given type.
Type: Type of enumerator
SubType: Subtype of enumerator
FatherIdentifier: Id of father object
DrawingIdentifier: Drawing from which data is fetched
ModelObjectIdentifier: Model object id from which data is fetched
types: Type filter.

Tekla.Structures.Drawing.DrawingEnumeratorBase.GetAllFromDB_FAST(Tekla.Structures.DrawingInternal.dotEnumerator_t@)
Gets the objects from DB. Enumerator's rules must
be correctly filled in before calling this method.
Enumerator: Enumerator including possible select rules and filters.
Returns:

Tekla.Structures.Drawing.DrawingEnumeratorBase.GetAllFromDB(Tekla.Structures.DrawingInternal.dotEnumerator_t@,System.Type[])
Gets the objects from DB. Enumerator's rules must
be correctly filled in before calling this method.
Enumerator: Enumerator including possible select rules and filters.
TypeFilter: Type filter
Returns: true if succeed

Tekla.Structures.Drawing.DrawingEnumeratorBase.MoveNext
Moves to the next item in the enumerator.
Returns: True if succeeded.

Tekla.Structures.Drawing.DrawingEnumeratorBase.Reset
Resets the enumerator to the beginning.

Tekla.Structures.Drawing.DrawingEnumeratorBase.GetSize
Returns the total amout of items.
Returns: The total amount of items.

Tekla.Structures.Drawing.DrawingEnumeratorBase.GetEnumerator
Allows the usage of the foreach statement with DrawingObjectEnumerator.
Returns: A pointer to the existing instance of the class.

Tekla.Structures.Drawing.DrawingEnumeratorBase.System#Collections#IEnumerator#Current
Implementation for the Curret property required by IEnumerator. The returned object
is always of type Drawing.

Tekla.Structures.Drawing.DrawingEnumeratorBase.GetCurrent
Returns the current item as an object. Needed to make IEnumerator.Current work correctly.
Returns: The current item as an object.